In [10]:
import pandas as pd
import numpy as np

In [4]:
mydict = {
    'Name' :  ['Taha', 'Ali', 'Sara'],
    'Age' : [14, 12, 13],
    'Score' : [19, 18, 20]
}

In [5]:
df = pd.DataFrame(mydict)

In [25]:
print(df, '\n')
df

   Name  Age  Score
0  Taha   14     19
1   Ali   12     18
2  Sara   13     20

   Name  Age  Score
0  Taha   14     19
1   Ali   12     18
2  Sara   13     20

In [26]:
df[['Name', 'Age']]

   Name  Age
0  Taha   14
1   Ali   12
2  Sara   13

In [27]:
df.iloc[1:, 1:]

   Age  Score
1   12     18
2   13     20

In [28]:
df.sort_values('Age')

   Name  Age  Score
1   Ali   12     18
2  Sara   13     20
0  Taha   14     19

In [30]:
df

   Name  Age  Score
0  Taha   14     19
1   Ali   12     18
2  Sara   13     20

In [31]:
df.sort_values('Age', inplace= True)

In [32]:
df

   Name  Age  Score
1   Ali   12     18
2  Sara   13     20
0  Taha   14     19

In [35]:
df['Age'].max()

14

In [36]:
df['Score'].min()

18

In [41]:
df[['Score', 'Age']].mean()

Score    19.0
Age      13.0
dtype: float64

In [46]:
df[df['Age'] < 13]

  Name  Age  Score
1  Ali   12     18

In [6]:
df.rename(columns= {'Score' : 'Grade'}, inplace= True)

In [7]:
df

   Name  Age  Grade
0  Taha   14     19
1   Ali   12     18
2  Sara   13     20

In [8]:
df['Name'] = df['Name'].replace({'Ali' : 'Ali reza'})

In [9]:
df

       Name  Age  Grade
0      Taha   14     19
1  Ali reza   12     18
2      Sara   13     20

In [16]:
arr = np.arange(12).reshape(4, 3)

In [17]:
df = pd.DataFrame(arr, columns= ['A', 'B', 'C'])
df

   A   B   C
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [21]:
df

   A   B   C
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [22]:
df.drop(['A', 'C'], axis= 1, inplace= False)

    B
0   1
1   4
2   7
3  10

In [25]:
df.drop(columns= ['A', 'B'], inplace= False)

    C
0   2
1   5
2   8
3  11

In [26]:
df

   A   B   C
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [29]:
data_dict = {
    'Student' : ['A', 'B', 'C'],
    'Grade' : [20, np.NaN, 19]
}

In [30]:
df = pd.DataFrame(data_dict)

In [31]:
df

  Student  Grade
0       A   20.0
1       B    NaN
2       C   19.0

In [36]:
df[df['Student'].isna()]

Empty DataFrame
Columns: [Student, Grade]
Index: []

In [37]:
df[df['Grade'].isna()]

  Student  Grade
1       B    NaN

In [39]:
df[df['Grade'].notna()]

  Student  Grade
0       A   20.0
2       C   19.0